app/controllers/images_controller.rb

	def create
		@image = Image.new(images_params)
		respond_to do |format|
      		if @image.save
---
INSERT INTO "images" ("picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"