app/controllers/orders_controller.rb

INSERT INTO "orders" ("from_date", "to_date", "room_id", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    @order.user_id = @user.id
    @order.status  = Order::STATUS_NEW
    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders"
---
  def index
    if current_user.admin?
      @orders = Order.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    def find_exist_user
      if current_user.nil?
        @user = User.new
      else
        @user = User.find current_user.id