app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 5]]
---
	def find_room
	 	@room = Room.find_by_id(params[:id])