app/controllers/welcome_controller.rb

  def pictures
  	@images = Image.all
---
SELECT "images".* FROM "images"